lib/tasks/dev.rake

    task add_default_admin: :environment do
    Admin.create!(
    email: 'admin@admin.com',
    password: DEFAULT_PASSWORD,
    password_confirmation: DEFAULT_PASSWORD
    )
---
INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)

    task add_default_user: :environment do
    User.create!(
    email: 'user@user.com',
    password: DEFAULT_PASSWORD,
    password_confirmation: DEFAULT_PASSWORD
    )
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  task answers_and_questions: :environment do
    Subject.all.each do |subject|
---
SELECT "subjects".* FROM "subjects"

  task reset_subject_counter: :environment do
    Subject.all.each do |subject|
---
SELECT "subjects".* FROM "subjects"