app/controllers/admins_backoffice/admins_controller.rb

SELECT  "admins".* FROM "admins" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "admins"
---
  def index
    @admins = Admin.all.page(params[:page])

INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @admin = Admin.new(params_admin)
    if @admin.save(params_admin)

UPDATE "admins" SET "email" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["email", "yyy@yyy.com.br"], ["encrypted_password", "$2a$11$ZXfTUMHocSOvsc4M2ZDEZ.0yFqZB/CUJ5LNfYw8XCx.P9dAb4D8I6"], ["updated_at", "2019-11-28 13:58:13.610123"], ["id", 15]]
---
  def update

      if @admin.update(params_admin)

DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 1]]
---
def destroy
  if @admin.destroy