app/controllers/admins_backoffice/questions_controller.rb

		def index
			@questions = Question.includes(:subject).order(:description).page(params[:page])
---
SELECT  "questions".* FROM "questions" ORDER BY "questions"."description" ASC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "questions"

		def create
			@question = Question.new(params_question)
				if @question.save
---
INSERT INTO "questions" ("description", "subject_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", ""], ["subject_id", 3], ["created_at", "2019-11-27 15:40:17.926784"], ["updated_at", "2019-11-27 15:40:17.926784"]]

		def update
			if @question.update(params_question)
---
UPDATE "questions" SET "description" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["description", "ffadadas"], ["updated_at", "2019-11-27 18:20:02.472332"], ["id", 5]]

	def destroy
		if @question.destroy
---
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 1]]