app/controllers/admins_backoffice/subjects_controller.rb

SELECT  "subjects".* FROM "subjects" ORDER BY "subjects"."description" ASC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
---
		def index
			@subjects =Subject.all.order(:description).page(params[:page])

INSERT INTO "subjects" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Arquitetura"], ["created_at", "2019-11-27 13:00:19.523143"], ["updated_at", "2019-11-27 13:00:19.523143"]]
---
		def create
			@subject =Subject.new(params_subject)
			if @subject.save(params_subject)

UPDATE "subjects" SET "description" = ?, "updated_at" = ? WHERE "subjects"."id" = ?  [["description", "Arquiteturas"], ["updated_at", "2019-11-27 13:00:25.513565"], ["id", 1]]
---
		def update

				if @subject.update(params_subject)

DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 1]]
---
	def destroy
		if @subject.destroy

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
			def set_admin
				@subject =Subject.find(params[:id])