app/views/admins_backoffice/questions/share/_form.html.erb

							<%= form.label :subject_id %>
							<%= form.collection_select(:subject_id, Subject.all, :id, :description, {}, {class:"form-control"}) %>
---
SELECT "subjects".* FROM "subjects"