app/controllers/site/answer_controller.rb

	def question
	@answer = Answer.find(params[:answer_id])
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]