app/views/site/shared/_questions.html.erb

		<ul>
			<% question.answers.each do |answer| %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 6]]