app/views/site/shared/_questions.html.erb

          <span class="label label-info">
            <%= link_to "#{question.subject.description}(#{question.subject.questions.count})", site_search_subject_path(question.subject_id, question.subject.description) , style:"color: white;" %></br></br>
---
SELECT  "questions".* FROM "questions" ORDER BY created_at desc LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 1]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."subject_id" = ?  [["subject_id", 2]]

        <ul>
          <% question.answers.each do |answer| %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 6]]